{
  "backend/main.mo": "Motoko backend actor managing products with admin-gated creation/seeding, public querying, search, and sorting plus authorization mixin.",
  "feature_evidence.json": "Feature evidence report mapping PWA‑related requirements to source files and components with high‑level metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/artifacts/.gitkeep": "Placeholder file ensuring the artifacts directory is tracked by Git.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to package the PWA as a Trusted Web Activity and publish it to Google Play Store.",
  "frontend/index.css": "Tailwind base and utility layers defining OKLCH‑based CSS variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry configuring PWA metadata, manifest links, icons, and script bootstrapping.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, shortcuts, and install configuration.",
  "frontend/public/offline.html": "Standalone offline fallback page displayed when the service worker serves offline mode.",
  "frontend/public/sw.js": "Service worker implementing asset precaching, cache cleanup, message handling, and a network-first fetch strategy with offline fallback.",
  "frontend/scripts/twa-build-aab-release.sh": "Build script that generates a signed release AAB using Bubblewrap, prompting for TWA directory and keystore details.",
  "frontend/scripts/twa-build-apk-debug.sh": "Builds a debug APK from a Bubblewrap TWA project and copies the output to an artifacts folder.",
  "frontend/scripts/twa-build-apk-release.sh": "Build script that creates a signed release APK using Bubblewrap after prompting for keystore information.",
  "frontend/scripts/twa-init.sh": "Initializes a new Bubblewrap TWA project from the live web manifest with prompts for output directory and package name.",
  "frontend/src/App.tsx": "Sets up the TanStack router, registers the service worker, runs a backend smoke check, and renders the app root.",
  "frontend/src/backend.did.ts": "Empty file intended to hold generated backend interface definitions.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Modal dialog wrapping the admin product form for creating or editing products.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Form for creating or updating products with validation, image upload, and mutation handling.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Table listing products with edit, delete, and stock toggle actions plus empty-state UI.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, price, stock status, and navigation to product details.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Manages PWA installation prompting logic and UI, including install detection, prompting, and fallback instructions.",
  "frontend/src/components/PwaUpdateBanner.tsx": "Shows a banner when a service worker update is available and lets users refresh or dismiss it.",
  "frontend/src/components/StoreFooter.tsx": "Renders the store’s footer with branding, links, and attribution.",
  "frontend/src/components/StoreHeader.tsx": "Displays the main site header with navigation, authentication-aware admin link, and PWA install prompt for desktop and mobile.",
  "frontend/src/components/StoreLayout.tsx": "Defines the overall store layout including header, footer, routed content, and PWA update banner.",
  "frontend/src/config/appConfig.ts": "Exports the app slug and metadata used for deployment and display.",
  "frontend/src/config/index.ts": "Loads environment config and creates the backend canister actor with its IDL interface.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useProducts.ts": "Defines product queries and mutations backed by the actor, including load, create, update, delete, stock toggle, and seed operations.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface requiring authentication to view, create, edit, and manage products.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section, features, and featured products loaded from backend.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page offering navigation back to home or product listings.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays a single product’s details, handling loading, errors, missing products, and fallback images.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with search, sorting, and loading/error states.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, listens for updates, and dispatches events for UI update prompts.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an uploaded image File into a base64 Data URL using FileReader.",
  "frontend/src/utils/runtimeSmokeCheck.ts": "Performs a non-blocking backend connectivity test by fetching products and logging results.",
  "frontend/src/utils/toUserMessage.ts": "Converts unknown error values into readable user-facing messages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and managing hash-based query parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and enables typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project metadata, PWA-related feature requirements, and current project state."
}