{
  "backend/main.mo": "Motoko canister defining product types and implementing CRUD, search, sorting, and stock toggling using a Map-based store.",
  "feature_evidence.json": "Metadata file describing feature evidence for documentation requirements and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend source files and components.",
  "frontend/artifacts/.gitkeep": "Placeholder file to retain the empty artifacts directory in version control.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Documentation explaining how to package the PWA as a TWA and publish it to Google Play Store, including prerequisites and setup steps.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color variables and dark mode theme tokens.",
  "frontend/index.html": "Main HTML entry file including PWA metadata, icons, manifest link, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app name, colors, start URL, icons, categories, and shortcuts.",
  "frontend/public/offline.html": "Styled offline fallback page shown when the PWA cannot reach the network.",
  "frontend/public/sw.js": "Service worker implementing network‑first caching with precaching, offline fallback, and cache cleanup.",
  "frontend/scripts/twa-build-aab-release.sh": "Builds a signed release AAB for a Bubblewrap TWA project, prompting for keystore details and outputting the bundle for Play Store submission.",
  "frontend/scripts/twa-build-apk-debug.sh": "Builds a debug APK from a TWA project and copies it to an artifacts directory for easy installation and testing.",
  "frontend/scripts/twa-build-apk-release.sh": "Generates a signed release APK for a Bubblewrap TWA project using a provided keystore, intended for distribution or testing.",
  "frontend/scripts/twa-init.sh": "Initializes a new Bubblewrap TWA project from a live web manifest, validating prerequisites and user inputs before generating project files.",
  "frontend/src/App.tsx": "Sets up the React app's routing using TanStack Router and registers the service worker on load.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Dialog wrapper for creating or editing a product, embedding the AdminProductForm.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Product create/edit form handling validation, image upload, and submit logic using product mutations.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Admin table listing products with actions for edit, delete, and stock toggling, plus empty-state UI.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, category, price, and navigation to product details, including stock indicators and fallback images.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Handles PWA installation prompts, showing install UI when available and offering fallback instructions when the browser doesn't provide a prompt.",
  "frontend/src/components/StoreFooter.tsx": "Renders the site footer with branding, navigation links, a promise statement, and a copyright line.",
  "frontend/src/components/StoreHeader.tsx": "Responsive store header with navigation links, authentication-aware admin link, PWA prompt, and mobile sheet menu.",
  "frontend/src/components/StoreLayout.tsx": "Layout wrapper that renders the header, footer, and main routed content area.",
  "frontend/src/config/appConfig.ts": "Defines app slug and metadata used for deployment and branding.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useProducts.ts": "React-query hooks for fetching and mutating product data through the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and wraps the app with Internet Identity.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for managing products with login gating, product table, and create/edit dialogs.",
  "frontend/src/pages/HomePage.tsx": "Home landing page showing hero content, features, and a grid of featured products.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed info for a single product with loading, error, and not‑found states.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search, sorting, and filtered grid of products.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker and logs registration status and update availability.",
  "frontend/src/utils/imageToDataUrl.ts": "Utility that converts an image File to a base64 Data URL using FileReader.",
  "frontend/src/utils/toUserMessage.ts": "Utility that converts unknown errors into user‑friendly message strings.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, OKLCH color variables, extended theming, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state for generating Android APKs, including schema info, feature requests, required PWA icons, and tasks for producing TWA-based debug builds."
}