{
  "backend/main.mo": "Motoko backend canister managing products with add, search, sort, and admin-restricted seeding using access control.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for deployment and configuration fixes.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short functional descriptions for documentation or build planning.",
  "frontend/artifacts/.gitkeep": "Placeholder file ensuring the artifacts directory is tracked in version control.",
  "frontend/docs/LIVE_DEPLOYMENT_SMOKE_CHECK.md": "Checklist for verifying a correct live Internet Computer deployment and frontend-backend connectivity.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Guide for packaging the PWA as an Android Trusted Web Activity and publishing it to Google Play Store.",
  "frontend/index.css": "Tailwind base and theme variables defining global light/dark color palettes and component styling.",
  "frontend/index.html": "Base HTML template loading the PWA manifest, icons, metadata, and bootstrapping the React app.",
  "frontend/public/env.json": "Runtime configuration file specifying backend canister ID and network for the deployed frontend.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, display mode, and shortcuts.",
  "frontend/public/offline.html": "Standalone offline fallback page shown when the PWA cannot reach the network.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, network‑first fetching, and special handling for env.json and API requests.",
  "frontend/scripts/twa-build-aab-release.sh": "Builds a signed release AAB using Bubblewrap, prompting for TWA directory and keystore details.",
  "frontend/scripts/twa-build-apk-debug.sh": "Builds a debug APK via Bubblewrap and copies it to an artifacts folder for easy installation or download.",
  "frontend/scripts/twa-build-apk-release.sh": "Generates a signed release APK using Bubblewrap after validating project and keystore settings.",
  "frontend/scripts/twa-init.sh": "Initializes a Bubblewrap TWA project from the live manifest, performing prerequisite checks and setup prompts.",
  "frontend/src/App.tsx": "Sets up the React router, registers the service worker, runs a backend smoke check, and renders the app layout.",
  "frontend/src/backend.did.ts": "Empty placeholder for generated backend canister types.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Modal dialog for creating or editing a product, embedding the admin product form.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Handles product creation and editing with form validation, image upload, and submit logic.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Displays a table of products with edit, delete, and stock toggle actions, including confirmations.",
  "frontend/src/components/ConfigErrorState.tsx": "Displays a detailed UI explaining configuration errors and provides guidance and a retry option.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, pricing, stock status, and navigation to the product details page.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Detects PWA install availability and shows an install button or fallback instructions, handling prompt events and install actions.",
  "frontend/src/components/PwaUpdateBanner.tsx": "Displays a banner when a new service worker update is ready and lets users refresh to apply it.",
  "frontend/src/components/StoreFooter.tsx": "Renders the site footer with branding, quick links, and a copyright notice.",
  "frontend/src/components/StoreHeader.tsx": "Provides the main site header with navigation, authentication-aware links, mobile menu, and PWA install prompt.",
  "frontend/src/components/StoreLayout.tsx": "Wraps the store UI with header, footer, update banner, and config loading/error handling.",
  "frontend/src/config/appConfig.ts": "Defines deployment slug and basic app metadata for configuration.",
  "frontend/src/config/index.ts": "Handles loading, validating, and caching runtime config and creates backend canister actors.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages the backend actor, refreshing it on identity changes.",
  "frontend/src/hooks/useEnvConfig.ts": "Loads environment config via React Query and exposes loading and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks to fetch and mutate products using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens.",
  "frontend/src/lib/errors.ts": "Defines a custom ConfigurationError class used for config validation failures.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin UI for viewing, creating, editing, and managing products with authentication gating.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner, featured products, and feature cards, loading product data and navigation actions.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page showing a not‑found message with buttons to navigate home or to products.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with loading, error, and not‑found states, plus navigation back to the products list.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with search, sorting, loading skeletons, and error handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, handles update detection, and dispatches related browser events.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an image File into a base64 Data URL using FileReader.",
  "frontend/src/utils/runtimeSmokeCheck.ts": "Runs a non‑blocking backend connectivity check by attempting to fetch products and logging results.",
  "frontend/src/utils/toUserMessage.ts": "Transforms unknown errors into user‑friendly messages with special handling for common backend issues.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing deployment issues, required fixes for canister ID configuration, and pending redeploy to the Internet Computer."
}