{
  "backend/main.mo": "Motoko backend canister implementing products CRUD, search, sorting, sample seeding with admin-only access control and user profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to relevant frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend files across the application.",
  "frontend/artifacts/.gitkeep": "Placeholder file ensuring the artifacts directory is tracked in version control.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Guide explaining how to package the PWA as a Trusted Web Activity and publish it to the Google Play Store.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theme values for light and dark modes.",
  "frontend/index.html": "Main HTML template defining metadata, manifest links, icons, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, start URL, shortcuts, and display settings.",
  "frontend/public/offline.html": "Custom offline fallback page shown when the PWA is unreachable without network connectivity.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first fetch handling with offline fallback.",
  "frontend/scripts/twa-build-aab-release.sh": "Builds a signed release AAB using Bubblewrap, prompting for TWA directory and keystore details.",
  "frontend/scripts/twa-build-apk-debug.sh": "Builds a debug APK from the TWA project and copies it to an artifacts folder.",
  "frontend/scripts/twa-build-apk-release.sh": "Builds a signed release APK using Bubblewrap with user‑provided keystore information.",
  "frontend/scripts/twa-init.sh": "Initializes a Bubblewrap TWA project from the live PWA manifest with prompts for package name and output directory.",
  "frontend/src/App.tsx": "Sets up the React Router configuration, registers the PWA service worker, and runs a backend smoke check.",
  "frontend/src/backend.did.ts": "Empty placeholder file for backend interface definitions.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Dialog wrapper for creating or editing products, embedding the AdminProductForm.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Form for creating or editing products with validation, image upload, and submit handling.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Admin table for listing products with edit, delete, and stock toggle actions.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, price, category, stock status, and navigation to product details.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Handles PWA installation prompts, showing install UI and fallbacks based on browser support.",
  "frontend/src/components/StoreFooter.tsx": "Renders the store’s footer with description, quick links, and branding.",
  "frontend/src/components/StoreHeader.tsx": "Responsive store header with navigation, authentication check, mobile menu, and PWA install prompt.",
  "frontend/src/components/StoreLayout.tsx": "Wraps pages with a header, footer, and main content outlet for the store layout.",
  "frontend/src/config/appConfig.ts": "Defines app slug and basic metadata such as name and tagline.",
  "frontend/src/config/index.ts": "Loads environment config and creates backend canister actors with IDL definitions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Wraps Dfinity AuthClient setup with custom options.",
  "frontend/src/hooks/useProducts.ts": "Defines React Query hooks for fetching, creating, updating, deleting, seeding, and toggling stock for products via the backend actor. Invalidates product queries on mutation success.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global base styles. Configures colors, spacing, and typography tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering App within React Query and Internet Identity providers. Loads global styles and initializes the QueryClient.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface that requires Internet Identity login to manage products, showing product list, create/edit dialogs, and loading/error states. Uses hooks for authentication and product data.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section, feature highlights, and a list of featured products with loading skeletons. Uses navigation and product data fetching.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404-style page with navigation options back to home or products. Uses card and button UI components.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view that loads product data, shows loading and error states, and displays full product information with fallback images. Provides navigation back to the product list.",
  "frontend/src/pages/ProductsPage.tsx": "Displays products with search, sorting, loading skeletons, and error handling using useProducts.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on load and logs registration, update events, or failures.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an image File to a base64 data URL using FileReader.",
  "frontend/src/utils/runtimeSmokeCheck.ts": "Performs a non-blocking backend connectivity check by fetching products and logging results.",
  "frontend/src/utils/toUserMessage.ts": "Normalizes unknown error values into user-friendly message strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL or session-stored parameters for routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and included plugins.",
  "project_state.json": "Tracks project metadata, feature states, requirements, and pending PWA asset tasks."
}