{
  "backend/main.mo": "Motoko canister managing products with CRUD operations, search, sorting, and sample seeding using an in‑memory map and incremental IDs.",
  "feature_evidence.json": "Feature evidence report listing implemented APK build and documentation features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file providing prewritten summaries for multiple frontend source files.",
  "frontend/artifacts/.gitkeep": "Placeholder file ensuring the artifacts directory is tracked in Git.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Detailed guide explaining how to package and publish the PWA as a Trusted Web Activity for Google Play Store.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point including PWA meta tags, manifest links, icons, and root React mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, shortcuts, and display behavior.",
  "frontend/public/offline.html": "Offline fallback HTML page shown when the user has no internet connectivity.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and a network‑first fetch strategy with offline fallback.",
  "frontend/scripts/twa-build-aab-release.sh": "Builds a signed release AAB for a Bubblewrap TWA project, prompting for project directory and keystore details.",
  "frontend/scripts/twa-build-apk-debug.sh": "Builds a debug APK from a Bubblewrap TWA project and copies the output to an artifacts folder.",
  "frontend/scripts/twa-build-apk-release.sh": "Builds a signed release APK for a Bubblewrap TWA project using a user‑provided keystore.",
  "frontend/scripts/twa-init.sh": "Initializes a Bubblewrap TWA project from a live manifest, validating prerequisites and prompting for package info.",
  "frontend/src/App.tsx": "Sets up the main React router with routes for home, products, product details, and admin, and registers the service worker.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Dialog wrapper for creating or editing products, embedding the AdminProductForm.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Form for creating or updating products with validation, image handling, and mutations.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Admin table displaying products with edit, delete, and stock toggle actions.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, pricing, stock status, and navigation to the product details page.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Handles PWA install prompts, showing install UI when available and fallback instructions otherwise.",
  "frontend/src/components/StoreFooter.tsx": "Renders the store footer with branding, links, a promise statement, and attribution.",
  "frontend/src/components/StoreHeader.tsx": "Responsive store header with navigation, authentication-aware links, PWA prompt, and mobile sheet menu.",
  "frontend/src/components/StoreLayout.tsx": "Page layout wrapper including header, main content outlet, and footer.",
  "frontend/src/config/appConfig.ts": "Centralized app deployment and metadata configuration including slug and branding.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, managing login, logout, and identity state.",
  "frontend/src/hooks/useProducts.ts": "React Query hooks for fetching and mutating product data through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and basic global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for viewing, creating, and editing products with authentication checks and dialogs.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing hero section, features, and featured product previews.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed info for a single product with loading, error, and not‑found states.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with search, sorting, and loading/error handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker and logs updates or registration failures.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an image File into a base64 data URL using FileReader.",
  "frontend/src/utils/toUserMessage.ts": "Transforms unknown errors into readable user-friendly messages.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, custom fonts, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, feature statuses, and requirements for generating a downloadable Android APK and verifying required PWA icon assets."
}