{
  "backend/main.mo": "Motoko actor managing an in‑memory product map with CRUD operations, search, sorting, and sample seeding.",
  "feature_evidence.json": "Feature evidence report mapping implemented PWA, service worker, install flow, and TWA guide features to their source files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries for various frontend source files.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Step‑by‑step guide explaining how to package the PWA as a Trusted Web Activity and publish it to Google Play.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, manifest link, icons, and script loader for the React app.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, icons, theme colors, and shortcuts.",
  "frontend/public/offline.html": "Styled offline fallback page shown when the user loses network connectivity.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and a network‑first fetch strategy with offline fallback.",
  "frontend/src/App.tsx": "Sets up the TanStack router with routes for home, products, product details, and admin, and registers the service worker.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Wraps the admin product form in a modal dialog for creating or editing products.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Provides a form for creating or editing products, handling validation, image uploads, and submission mutations.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Displays a table of products with actions for editing, deleting, and toggling stock status.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, price, category, stock status, and navigation to the product details page.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Handles PWA install prompt logic, showing install UI when available and fallback instructions otherwise.",
  "frontend/src/components/StoreFooter.tsx": "Renders the site footer with branding, quick links, and a copyright message.",
  "frontend/src/components/StoreHeader.tsx": "Renders the site header with navigation, logo, PWA prompt, mobile menu, and optional admin link based on authentication.",
  "frontend/src/components/StoreLayout.tsx": "Defines the main page layout with header, outlet content area, and footer.",
  "frontend/src/config/appConfig.ts": "Defines the app slug and static application metadata including name and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and utilities for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useProducts.ts": "Provides product CRUD hooks using the backend actor and react-query, including fetching, seeding, creating, updating, deleting, and toggling stock.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for themes, including light and dark mode tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface that requires authentication to view and manage products, including creating and editing through dialogs.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section, features, and a preview of featured products leveraging product data.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Renders a detailed view for a single product, handling loading, errors, not‑found states, and displaying product info with badges and images. Uses routing, product lookup, and UI components.",
  "frontend/src/pages/ProductsPage.tsx": "Displays the full product catalog with search, sorting, filtering, and loading/error handling. Renders product cards in a responsive grid.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs update events or failures. Handles update detection via the registration’s updatefound event.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an image File into a base64 Data URL using FileReader with error handling. Returns a Promise that resolves to the string result.",
  "frontend/src/utils/toUserMessage.ts": "Transforms unknown error values into a readable user‑friendly message string. Handles strings, Error objects, and generic objects with a message field.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom fonts, colors, animations, container settings, and plugins including typography, container queries, and animation utilities.",
  "project_state.json": "Tracks the project’s state, features, and new requests related to PWA support and Android APK/Play Store packaging via TWA. Includes metadata, requirements, and image asset needs."
}