{
  "backend/main.mo": "Main canister logic defining product types, access control, storage maps, and admin‑only product seeding and insertion functions.",
  "backend/migration.mo": "Migration module converting old product records to new ones by adding external ID fields while preserving existing data.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the app.",
  "frontend/artifacts/.gitkeep": "Placeholder file ensuring the artifacts directory is committed.",
  "frontend/docs/LIVE_DEPLOYMENT_SMOKE_CHECK.md": "Guide for verifying a live deployment and ensuring the frontend communicates correctly with the backend canister.",
  "frontend/docs/PLAY_STORE_TWA_GUIDE.md": "Detailed instructions for packaging the PWA as a Trusted Web Activity and publishing it to the Google Play Store.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring colors, radii, and global styling for light and dark modes.",
  "frontend/index.html": "Main HTML entrypoint defining metadata, PWA manifest links, icons, and mounting the React app.",
  "frontend/public/env.json": "Deployment configuration file containing backend canister ID and network settings to be filled during deployment.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, icons, theme colors, and shortcuts for the bajya's market app.",
  "frontend/public/offline.html": "Static offline fallback page with styling and a retry button for when the app has no network connection.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first fetch handling with special rules for env.json and backend API calls.",
  "frontend/scripts/twa-build-aab-release.sh": "Shell script that builds a signed TWA release AAB using Bubblewrap and a provided keystore for Play Store submission.",
  "frontend/scripts/twa-build-apk-debug.sh": "Shell script that builds a debug APK from the TWA project and copies it to an artifacts folder for testing.",
  "frontend/scripts/twa-build-apk-release.sh": "Shell script that builds a signed TWA release APK using Bubblewrap and a user-provided keystore.",
  "frontend/scripts/twa-init.sh": "Script that initializes a Bubblewrap TWA project using the live PWA manifest and user-specified package details.",
  "frontend/src/App.tsx": "Main React app that sets up routing, registers the service worker, and runs a backend connectivity smoke check.",
  "frontend/src/backend.did.ts": "Empty placeholder file intended for backend canister interface definitions.",
  "frontend/src/components/admin/AdminProductDialog.tsx": "Modal dialog wrapping the product form for creating or editing a product.",
  "frontend/src/components/admin/AdminProductForm.tsx": "Form for creating or editing products including validation, image upload, and submission logic.",
  "frontend/src/components/admin/AdminProductsTable.tsx": "Displays a product table with edit, delete, and stock toggle actions, including empty-state UI handling.",
  "frontend/src/components/admin/AdminShopifySyncSection.tsx": "Provides inputs and actions to test Shopify API credentials and sync products, with status and error handling.",
  "frontend/src/components/ConfigErrorState.tsx": "React component displaying detailed UI explaining configuration errors related to env.json and backend connectivity.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, price, stock status, and navigation to product details.",
  "frontend/src/components/PwaInstallPrompt.tsx": "Shows a PWA install button or fallback instructions based on browser install prompt availability.",
  "frontend/src/components/PwaUpdateBanner.tsx": "Displays a banner when a service worker update is available and allows refreshing to apply it.",
  "frontend/src/components/StoreFooter.tsx": "Renders the store footer with branding, links, and a copyright notice.",
  "frontend/src/components/StoreHeader.tsx": "Provides the site header with navigation, auth-based admin link, PWA install prompt, and mobile menu.",
  "frontend/src/components/StoreLayout.tsx": "Handles overall page layout with header, footer, config checks, and PWA update banner.",
  "frontend/src/config/appConfig.ts": "Defines the app slug and basic metadata like name and tagline.",
  "frontend/src/config/index.ts": "Loads and validates runtime env configuration, ensuring valid canister IDs and creating actors with the correct settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the current identity, reloading dependent queries when it changes.",
  "frontend/src/hooks/useEnvConfig.ts": "Loads environment configuration via loadConfig and exposes loading and error state for UI gating.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity loading, and DelegationIdentity validation.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to check whether the current caller is an admin, based on the active actor.",
  "frontend/src/hooks/useProducts.ts": "Defines product-related queries and mutations (CRUD, stock toggle, seed) using the backend actor and react-query.",
  "frontend/src/hooks/useShopifySync.ts": "React hook that fetches Shopify products, maps them to backend input format, and triggers a bulk upsert via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining base theme variables for light and dark modes.",
  "frontend/src/lib/errors.ts": "Defines a custom ConfigurationError class for config-related exceptions.",
  "frontend/src/lib/shopifyStorefront.ts": "Implements Shopify Storefront API client utilities for building URLs, testing connections, and fetching product data.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard handling authentication, admin checks, and product management UI including create/edit dialogs.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing a hero section, features, and featured products fetched from the backend.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page offering navigation back to home or product listings.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view that loads a product by ID, handles loading/errors, and displays full product info.",
  "frontend/src/pages/ProductsPage.tsx": "Displays all products with search, sorting, loading skeletons, and error handling using data from useProducts.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, logs status, and dispatches events for update readiness and activation.",
  "frontend/src/utils/imageToDataUrl.ts": "Converts an image File into a base64 data URL using FileReader.",
  "frontend/src/utils/runtimeSmokeCheck.ts": "Runs a non-blocking backend connectivity check by loading config and fetching products, logging errors without throwing.",
  "frontend/src/utils/toUserMessage.ts": "Maps various error types to user-friendly messages, including Shopify-specific and backend errors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "Tracks project state, requirements, features, issues, and Shopify sync-related development context."
}