{
  "kind": "build_request",
  "title": "Convert the existing web app into an installable Progressive Web App (PWA)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the app meets installable PWA requirements by validating and, if needed, updating the PWA manifest and HTML metadata (name/short_name, start_url/scope, display mode, theme/background colors, icons, and Apple install meta tags) so that the manifest is correctly detected by browsers and the app can be installed on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Trun into a progressive web app"
        ]
      },
      "acceptanceCriteria": [
        "The manifest is accessible at `/manifest.webmanifest` and is valid JSON that includes `name`, `short_name`, `start_url`, `scope`, `display`, `theme_color`, `background_color`, and a 192x192 + 512x512 icon set (including a maskable icon).",
        "`frontend/index.html` contains a `<link rel=\"manifest\" ...>` tag and appropriate PWA-related meta tags (at minimum: `theme-color`, and Apple install meta + touch icon).",
        "Installing the app from a supported browser results in a standalone app window (display-mode: standalone)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden service worker behavior for a reliable PWA experience: ensure the service worker is registered in supported browsers, provides an offline fallback for navigation when the network is unavailable, and uses a cache strategy that avoids breaking non-GET requests and non-http(s) requests.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Trun into a progressive web app"
        ]
      },
      "acceptanceCriteria": [
        "A service worker is registered at `/sw.js` and activates successfully on first load in a modern browser.",
        "When the network is disconnected and the user refreshes or navigates to a route, a user-friendly offline fallback page is served for navigation requests.",
        "Non-GET requests are not intercepted by the service worker."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a user-facing update flow for the PWA so users are informed when a new version is available and can refresh to activate the updated service worker (e.g., show a small banner/toast with a “Refresh” action when an update is installed and the page is controlled by an older worker).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Trun into a progressive web app"
        ]
      },
      "acceptanceCriteria": [
        "When a new service worker is installed while the app is open, the UI displays a clear English message indicating an update is available.",
        "Clicking the refresh action reloads the app and the new service worker takes control (confirmed by absence of the update prompt after reload)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure there is an in-app installation entry point: provide an “Install App” control that uses the `beforeinstallprompt` flow when available and provides clear fallback instructions when the install prompt is not available or the app is already installed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Trun into a progressive web app"
        ]
      },
      "acceptanceCriteria": [
        "If the `beforeinstallprompt` event is available, clicking “Install App” triggers the native install prompt.",
        "If the app is already installed (standalone display-mode), the install UI is not shown.",
        "If the prompt is not available, the UI shows clear English installation instructions for at least Android Chrome."
      ]
    }
  ],
  "constraints": [
    "Frontend files listed as immutable in SYSTEM_CONTEXT must not be modified (compose existing UI components instead of editing them).",
    "Keep the backend as a single Motoko actor; no backend changes are required for PWA functionality."
  ],
  "nonGoals": [
    "Publishing an APK/AAB directly from this project.",
    "Adding third-party push notification services or real-time WebSocket features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}