{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix production go-live issues and verify live PWA readiness (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the frontend-side root cause(s) that prevent production go-live/build from succeeding (e.g., missing module exports / type mismatches) while preserving core flows.",
      "acceptanceCriteria": [
        "A production deployment (go-live) completes successfully without errors.",
        "No regression in core functionality (product list fetch, product details route, admin page access gating) after the fix.",
        "If backend state schema changes are required, add a conditional Motoko migration in `backend/migration.mo`; otherwise do not change migration behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/index.ts",
          "operation": "create",
          "description": "Create a config barrel that exports the backend actor factory used across the app (e.g., `createActorWithConfig`) to resolve current build/go-live failures from missing module resolution. Use the core-infrastructure component’s backend connection configuration patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Adjust actor initialization to be production-build safe: align the actor type usage with the generated backend typings (or safely narrow/cast for internal initialization helpers) so TypeScript does not fail go-live builds while keeping the existing admin access gating behavior intact. Verify the authorization component’s frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/runtimeSmokeCheck.ts",
          "operation": "modify",
          "description": "Update imports to use the new `frontend/src/config/index.ts` barrel (rather than relying on a potentially missing path) so production builds resolve consistently; keep the smoke check non-blocking and non-throwing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure all PWA icon assets referenced by the manifest exist under frontend/public/assets/generated with exact filenames and sizes.",
      "acceptanceCriteria": [
        "`frontend/public/assets/generated/pwa-icon-192.dim_192x192.png` exists and is 192x192.",
        "`frontend/public/assets/generated/pwa-icon-512.dim_512x512.png` exists and is 512x512.",
        "`frontend/public/assets/generated/pwa-icon-maskable-512.dim_512x512.png` exists and is 512x512 and suitable for maskable usage (safe-area composition).",
        "The manifest icons load without 404s when the app is served (no missing icon requests in browser devtools network panel)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/pwa-icon-192.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated 192x192 PWA icon asset at the exact required path and filename: frontend/public/assets/generated/pwa-icon-192.dim_192x192.png."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon-512.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 PWA icon asset at the exact required path and filename: frontend/public/assets/generated/pwa-icon-512.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/pwa-icon-maskable-512.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 maskable PWA icon asset at the exact required path and filename: frontend/public/assets/generated/pwa-icon-maskable-512.dim_512x512.png (ensure maskable safe-area composition)."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Verify the manifest icon entries exactly match the required filenames and sizes and remain consistent with the generated assets under frontend/public/assets/generated/ (adjust only if any mismatch is found)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add lightweight runtime checks and guardrails to help verify the live PWA works at the production origin, including routing, product loading, 404 behavior, and service worker registration stability.",
      "acceptanceCriteria": [
        "Visiting https://bajyasmarketshop.icp0.io loads the app successfully.",
        "Navigating to the Home page, Products page, and a Product Details page works without routing errors.",
        "The product list loads successfully from the backend (no uncaught exceptions; user-facing errors are handled).",
        "The 404 / Not Found route renders when visiting an unknown path.",
        "Service worker registers without throwing runtime errors in console (warnings are acceptable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the existing non-blocking runtime smoke check into app startup (alongside service worker registration) to aid production verification of backend connectivity and routing without impacting user experience."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Harden service worker registration logging/error handling so production runtime does not throw uncaught errors during registration (keep warnings/logs acceptable per requirement)."
        },
        {
          "path": "frontend/src/utils/runtimeSmokeCheck.ts",
          "operation": "modify",
          "description": "Ensure smoke check gracefully handles failures and logs actionable diagnostics for production verification (no uncaught exceptions), using the same actor creation path as the rest of the app via the core-infrastructure configuration. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}