{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resolve live IC deployment config by providing env.json, validating canister ID, and showing actionable UI errors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the live/public frontend loads and is wired to the correct backend canister configuration at runtime.",
      "acceptanceCriteria": [
        "Opening the live/public app URL loads the React app (not the IC gateway “Canister ID Not Resolved” page).",
        "The frontend can successfully call the backend (e.g., products list loads without backend connectivity errors) when accessed from the live URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/index.ts",
          "operation": "modify",
          "description": "Harden runtime configuration loading (from /env.json) and canister ID validation so the actor is never created with a placeholder/invalid canister ID; continue to use the existing core-infrastructure config/actor creation pattern. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Adjust service worker caching rules to avoid caching /env.json (and avoid precaching it) so live deployments always pick up the latest runtime config after redeploy."
        },
        {
          "path": "frontend/src/utils/runtimeSmokeCheck.ts",
          "operation": "modify",
          "description": "Update the smoke check to report configuration/actor initialization failures distinctly from general connectivity issues, supporting faster verification from the live URL."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide a production /env.json and ensure the frontend consumes it to initialize the backend actor with a non-placeholder canister ID.",
      "acceptanceCriteria": [
        "In the live deployment, `GET /env.json` returns HTTP 200 and includes a non-placeholder backend canister ID.",
        "In the live deployment, the app initializes the actor using the canister ID from `/env.json` (verified by successful calls like `getAllProducts`)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/env.json",
          "operation": "create",
          "description": "Add a runtime configuration file served at /env.json with the required keys (BACKEND_CANISTER_ID or canisterId, and DFX_NETWORK). Include clear placeholders/comments-free JSON and document that values must be replaced during live deployment."
        },
        {
          "path": "frontend/src/config/index.ts",
          "operation": "modify",
          "description": "Ensure /env.json parsing supports BACKEND_CANISTER_ID/canisterId and DFX_NETWORK, and fails fast with a typed/configurable error when values are missing/empty/placeholder; continue to use core-infrastructure for actor creation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show a user-facing English error state when backend configuration is missing/invalid instead of silently failing.",
      "acceptanceCriteria": [
        "If `/env.json` is missing/invalid in a production build, the UI shows a clear error message indicating backend configuration is not set (instead of only console warnings).",
        "The error message does not expose secrets and includes actionable next steps (e.g., redeploy with correct canister ID in env.json)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEnvConfig.ts",
          "operation": "create",
          "description": "Create a small hook to load and validate runtime env configuration (via frontend/src/config/index.ts) and expose a stable UI state (loading/ok/error) for app-wide rendering decisions."
        },
        {
          "path": "frontend/src/components/ConfigErrorState.tsx",
          "operation": "create",
          "description": "Add a user-facing configuration error component that explains the missing/invalid /env.json problem and provides actionable next steps; use shadcn-ui (e.g., Alert/Card/Button) for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StoreLayout.tsx",
          "operation": "modify",
          "description": "Wire the ConfigErrorState into the main layout so that when runtime config is invalid/missing, the app shows the error state instead of rendering normal routes; use the new useEnvConfig hook."
        },
        {
          "path": "frontend/src/utils/toUserMessage.ts",
          "operation": "modify",
          "description": "Extend error-to-message mapping to recognize and format configuration/actor initialization errors into clear English UI messages without exposing secrets."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prepare the project for a clean redeploy and provide a repeatable smoke-check checklist for confirming the live URL works.",
      "acceptanceCriteria": [
        "A fresh live deployment is produced after the fix, and the live app URL loads successfully.",
        "A post-deploy smoke check confirms the frontend can reach the backend canister in production."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/LIVE_DEPLOYMENT_SMOKE_CHECK.md",
          "operation": "create",
          "description": "Document the redeploy checklist focused on frontend runtime config: verify /env.json returns 200, contains non-placeholder BACKEND_CANISTER_ID/canisterId and DFX_NETWORK=ic, confirm the app loads at the canister URL, and confirm product list loads (getAllProducts) from the live URL."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Add a note in code comments (and ensure behavior) that /env.json should not be cached so redeploys immediately take effect, supporting reliable post-deploy validation."
        }
      ]
    }
  ]
}